# PANDAS

## Pandas is the most widely use tool for data munging, It contains high-level data structures and manipulation tools designed to make dataanalysis fast and easy.
## It is work on series and Dataframe.

In [128]:
# import the pandas liberies
import pandas as pd
import numpy as np

In [129]:
pd.__version__                                 # check the versione of liberies

'0.24.2'

In [130]:
s = pd.Series([1,2,3,4,56,6,5])               # create series from list
s

0     1
1     2
2     3
3     4
4    56
5     6
6     5
dtype: int64

In [131]:
k=[4,5,'ram']                                # including string
d= pd.Series(k)
d

0      4
1      5
2    ram
dtype: object

In [132]:
                                               # create series from ndarray

In [133]:
q = np.array(range(1,15))
w = pd.Series(q)
w

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
dtype: int32

In [134]:
# we add our index
np.array(range(10,140,10))

array([ 10,  20,  30,  40,  50,  60,  70,  80,  90, 100, 110, 120, 130])

In [135]:
q = np.array(range(1,15))
w = pd.Series(q,index= np.array(range(10,150,10)))   # we can also change the index
w

10      1
20      2
30      3
40      4
50      5
60      6
70      7
80      8
90      9
100    10
110    11
120    12
130    13
140    14
dtype: int32

In [136]:
s = pd.Series(['a','b','c',' '],index=['p','hq','+','3'])
s

p     a
hq    b
+     c
3
dtype: object

#  Create a series from dict

In [137]:
data={'tarun':0,'a':200,'c':300}
s= pd.Series(data)
s

tarun      0
a        200
c        300
dtype: int64

In [138]:
data={'tarun':0,'a':200,'c':300}
s= pd.Series(data , index=['c','d','a','q','tarun'])
s                                                                      # u can  add extra index  only in dict as nan

c        300.0
d          NaN
a        200.0
q          NaN
tarun      0.0
dtype: float64

#  Create a series from scalar

In [139]:

m= pd.Series('SBI'*10)
m

0    SBISBISBISBISBISBISBISBISBISBI
dtype: object

In [140]:
m= pd.Series('SBI',index=[np.arange(1,11)])
m

1     SBI
2     SBI
3     SBI
4     SBI
5     SBI
6     SBI
7     SBI
8     SBI
9     SBI
10    SBI
dtype: object

In [141]:
s = pd.Series([1,2,3,4,5], index=[10,11,12,13,14])      # slicing
s[:3]

10    1
11    2
12    3
dtype: int64

In [142]:
s[-3:]

12    3
13    4
14    5
dtype: int64

In [143]:
s[::-1]

14    5
13    4
12    3
11    2
10    1
dtype: int64

#  DATAFRAME

In [144]:
#   Cretae the Dataframe using list

In [145]:
data = [1,2,3,45,4]
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [146]:
data = [1,2,3,45,4]
df = pd.DataFrame(data)
df

    0
0   1
1   2
2   3
3  45
4   4

In [147]:
# using multiple list
d = [['d',5],['s',52]]
e = pd.DataFrame(d)
e

   0   1
0  d   5
1  s  52

In [148]:
d = [['d',5],['s',52]]
e = pd.DataFrame(d,columns=['name','age'])
e

  name  age
0    d    5
1    s   52

In [149]:
e.age

0     5
1    52
Name: age, dtype: int64

In [150]:
e.name

0    d
1    s
Name: name, dtype: object

In [151]:
e.columns

Index(['name', 'age'], dtype='object')

In [152]:
e.dtypes

name    object
age      int64
dtype: object

In [153]:
e.index[0]

0

In [154]:
d = [['salman',53],['sharukh',52]]
e = pd.DataFrame(d,columns=['name','age'],index=['sultan','don'])
e

           name  age
sultan   salman   53
don     sharukh   52

In [155]:
e.index[1]

'don'

In [156]:
e[1:2]

        name  age
don  sharukh   52

In [157]:
e[:2]

           name  age
sultan   salman   53
don     sharukh   52

# dataframe from dict of list

In [158]:
import pandas as pd
data = {'name':['raju','sham','baburao','Tiwari'],'age':[10,20,30,40]}
df = pd.DataFrame(data,index=[101,102,103,104])
df

        name  age
101     raju   10
102     sham   20
103  baburao   30
104   Tiwari   40

In [159]:
data = {'name':['raju','sham','baburao','Tiwari'],'age':[10]}
df = pd.DataFrame(data,index=[101,102,103,104])
df

        name  age
101     raju   10
102     sham   10
103  baburao   10
104   Tiwari   10

#  by passing list in dict

In [160]:
data =[{'a':2,'b':20},{'a':20,'c':200,'b':30}]
df = pd.DataFrame(data)
df

    a   b      c
0   2  20    NaN
1  20  30  200.0

# from dict of series

In [161]:
data={'one':pd.Series([1,23,4,5]),'two':pd.Series([4,5,6,8])}
df = pd.DataFrame(data)
df

   one  two
0    1    4
1   23    5
2    4    6
3    5    8

In [162]:
data={'one':pd.Series([1,23,4,5,6]),'two':pd.Series([4,5,6,8])}
df = pd.DataFrame(data,dtype='float64')
df

    one  two
0   1.0  4.0
1  23.0  5.0
2   4.0  6.0
3   5.0  8.0
4   6.0  NaN

In [163]:
df['three']= df['one']+df['two']
df

    one  two  three
0   1.0  4.0    5.0
1  23.0  5.0   28.0
2   4.0  6.0   10.0
3   5.0  8.0   13.0
4   6.0  NaN    NaN

In [164]:
df['three']= df['one']*df['two']
df

    one  two  three
0   1.0  4.0    4.0
1  23.0  5.0  115.0
2   4.0  6.0   24.0
3   5.0  8.0   40.0
4   6.0  NaN    NaN

In [165]:
df[['two','three']]

   two  three
0  4.0    4.0
1  5.0  115.0
2  6.0   24.0
3  8.0   40.0
4  NaN    NaN

In [166]:
df.transpose()

         0      1     2     3    4
one    1.0   23.0   4.0   5.0  6.0
two    4.0    5.0   6.0   8.0  NaN
three  4.0  115.0  24.0  40.0  NaN

In [167]:
del df['three']

In [168]:
df

    one  two
0   1.0  4.0
1  23.0  5.0
2   4.0  6.0
3   5.0  8.0
4   6.0  NaN

In [169]:
df.pop('two')

0    4.0
1    5.0
2    6.0
3    8.0
4    NaN
Name: two, dtype: float64

In [170]:
df

    one
0   1.0
1  23.0
2   4.0
3   5.0
4   6.0

# selection adding of rowes

In [171]:
d ={'one':pd.Series([7,8,9,5],index=['a','b','c','d']), 'two':pd.Series([78,96,54,25],index=['a','b','c','d'])}
df = pd.DataFrame(d)
df

   one  two
a    7   78
b    8   96
c    9   54
d    5   25

In [172]:
# selection by label/ loc    # it's stand for label   # using label

In [173]:
# it is use for row acces

In [174]:
df.loc['b':'c']

   one  two
b    8   96
c    9   54

In [175]:
# for integer location
df.iloc[::-1]

   one  two
d    5   25
c    9   54
b    8   96
a    7   78

In [176]:
df.iloc[3]

one     5
two    25
Name: d, dtype: int64

In [177]:
# same as slicing
df.iloc[2::,:1:]

   one
c    9
d    5

In [178]:
# slice opration on rowes
df[1:2]

   one  two
b    8   96

In [179]:
df.loc['b']['one']

8

In [180]:
df.iloc[1:2:,:1:]=40

In [181]:
df

   one  two
a    7   78
b   40   96
c    9   54
d    5   25

# Addition using append

In [182]:
# u apply append when dimeions and size ,shape same

In [183]:
df= pd.DataFrame([[1,2],[3,4]],columns=['a','b'])
df2=pd.DataFrame([[55,56],[31,43]],columns=['a','b'])
df = df.append(df2)
df

    a   b
0   1   2
1   3   4
0  55  56
1  31  43

In [184]:
# delete row using drop

In [185]:
df.drop(0)   # or df .drop(index=1)

    a   b
1   3   4
1  31  43

In [186]:
df.drop(columns='a')

    b
0   2
1   4
0  56
1  43

In [187]:
df

    a   b
0   1   2
1   3   4
0  55  56
1  31  43

In [188]:
df.drop(columns='b')

    a
0   1
1   3
0  55
1  31

In [189]:
df.iloc[1:3:,1::]=40
df

    a   b
0   1   2
1   3  40
0  55  40
1  31  43

#  simple way to dataframe

In [190]:
df =pd.DataFrame(np.arange(12).reshape(3,4))
df

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [191]:
df =pd.DataFrame(np.arange(-6,6).reshape(3,4))
df

   0  1  2  3
0 -6 -5 -4 -3
1 -2 -1  0  1
2  2  3  4  5

In [192]:
df =pd.DataFrame(np.arange(12).reshape(3,4),columns=['a','b','c','d'],index=['p','q','ni'])
df

    a  b   c   d
p   0  1   2   3
q   4  5   6   7
ni  8  9  10  11

In [193]:
df.iloc[0::2,1:3:]

    b   c
p   1   2
ni  9  10

In [194]:
df.loc[::2,'b':'c':]

    b   c
p   1   2
ni  9  10

#  some bascie functionality

In [195]:
s= pd.Series(np.random.randint(4,10,10))
s

0    7
1    9
2    7
3    6
4    9
5    7
6    9
7    5
8    5
9    7
dtype: int32

In [196]:
s= pd.DataFrame(np.random.randint(4,10,10))
s

   0
0  8
1  4
2  9
3  4
4  4
5  5
6  7
7  4
8  8
9  6

In [197]:
# axes

In [198]:
s.axes

[RangeIndex(start=0, stop=10, step=1), RangeIndex(start=0, stop=1, step=1)]

In [199]:
# empty     # just check it Dataframe is empty or not

In [200]:
s.empty

False

In [201]:
# ndim   for check the dimensione

In [202]:
s.ndim

2

In [203]:
# size              # return the no, of element present in the dataframe
s.size

10

In [204]:
s.shape

(10, 1)

In [205]:
# values
s.values

array([[8],
       [4],
       [9],
       [4],
       [4],
       [5],
       [7],
       [4],
       [8],
       [6]])

In [206]:
# head

In [207]:
s.head(4)     # default is 5  first five elemnt return

   0
0  8
1  4
2  9
3  4

In [208]:
# tail

In [209]:
s.tail(2)      #   last values deafult five element

   0
8  8
9  6

# Dataframe Basic functionality

In [210]:
data= {'name':pd.Series(['as','dgbv','sdfg','sdfg','grthg' ]),'age':pd.Series([20,30,50,50,60]),'rate':pd.Series([450,890,456,520,360])}
df=pd.DataFrame(data)
df

    name  age  rate
0     as   20   450
1   dgbv   30   890
2   sdfg   50   456
3   sdfg   50   520
4  grthg   60   360

In [211]:
df.describe()                # summary of data   work on  numerice

             age        rate
count   5.000000    5.000000
mean   42.000000  535.200000
std    16.431677  206.361818
min    20.000000  360.000000
25%    30.000000  450.000000
50%    50.000000  456.000000
75%    50.000000  520.000000
max    60.000000  890.000000

In [212]:
# for seprate
df.min()       # strring work on asciki

name     as
age      20
rate    360
dtype: object

In [213]:
df.max()            # retrun max value

name    sdfg
age       60
rate     890
dtype: object

In [214]:
ord('a')

97

In [215]:
chr(65)

'A'

In [216]:
df.count()

name    5
age     5
rate    5
dtype: int64

In [217]:
df.T               #  transpose

        0     1     2     3      4
name   as  dgbv  sdfg  sdfg  grthg
age    20    30    50    50     60
rate  450   890   456   520    360

In [218]:
df

    name  age  rate
0     as   20   450
1   dgbv   30   890
2   sdfg   50   456
3   sdfg   50   520
4  grthg   60   360

In [219]:
df.dtypes

name    object
age      int64
rate     int64
dtype: object

In [220]:
df.empty

False

In [221]:
df.ndim

2

In [222]:
df.size

15

In [223]:
df.values

array([['as', 20, 450],
       ['dgbv', 30, 890],
       ['sdfg', 50, 456],
       ['sdfg', 50, 520],
       ['grthg', 60, 360]], dtype=object)

In [224]:
df.head(1)

  name  age  rate
0   as   20   450

In [225]:
df.tail(2)

    name  age  rate
3   sdfg   50   520
4  grthg   60   360

In [226]:
df[df['rate']>500][['name','age']]

   name  age
1  dgbv   30
3  sdfg   50

In [227]:
df[df['name']=='dgbv']

   name  age  rate
1  dgbv   30   890

In [228]:
df[(df ['age']>35)& (df ['rate']>500)]

   name  age  rate
3  sdfg   50   520

In [229]:
# data anaylist

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
name    5 non-null object
age     5 non-null int64
rate    5 non-null int64
dtypes: int64(2), object(1)
memory usage: 200.0+ bytes

In [230]:
import pandas as pd 
import numpy as np

In [231]:
data ={'name':pd.Series(['anuj','rimi','amit','shobha','arnav','abhi','tarun']),'age':pd.Series([25,26,30,32,27,36,40]),'percantage':pd.Series([59.76,67.78,80,85,78.33,60,75])}
df=pd.DataFrame(data)
df

     name  age  percantage
0    anuj   25       59.76
1    rimi   26       67.78
2    amit   30       80.00
3  shobha   32       85.00
4   arnav   27       78.33
5    abhi   36       60.00
6   tarun   40       75.00

In [232]:
df.sum()

name          anujrimiamitshobhaarnavabhitarun
age                                        216
percantage                              505.87
dtype: object

In [233]:
df.sum(axis=1)   # for row wise

0     84.76
1     93.78
2    110.00
3    117.00
4    105.33
5     96.00
6    115.00
dtype: float64

In [234]:
df.mean()

age           30.857143
percantage    72.267143
dtype: float64

In [235]:
df.std()

age           5.550633
percantage    9.943133
dtype: float64

In [236]:
df['age'].mean()

30.857142857142858

In [237]:
df.mean()['age']

30.857142857142858

In [238]:
df.median()

age           30.0
percantage    75.0
dtype: float64

In [239]:
df.min()

name           abhi
age              25
percantage    59.76
dtype: object

In [240]:
df.cumsum()

                               name  age percantage
0                              anuj   25      59.76
1                          anujrimi   51     127.54
2                      anujrimiamit   81     207.54
3                anujrimiamitshobha  113     292.54
4           anujrimiamitshobhaarnav  140     370.87
5       anujrimiamitshobhaarnavabhi  176     430.87
6  anujrimiamitshobhaarnavabhitarun  216     505.87

In [241]:
df.cummax()

     name age percantage
0    anuj  25      59.76
1    rimi  26      67.78
2    rimi  30         80
3  shobha  32         85
4  shobha  32         85
5  shobha  36         85
6   tarun  40         85

# Sumarries data

In [242]:
df.describe(include=['object'])      # it's summerices columns

        name
count      7
unique     7
top     anuj
freq       1

In [243]:
df.describe()

             age  percantage
count   7.000000    7.000000
mean   30.857143   72.267143
std     5.550633    9.943133
min    25.000000   59.760000
25%    26.500000   63.890000
50%    30.000000   75.000000
75%    34.000000   79.165000
max    40.000000   85.000000

In [244]:
df.describe(include='all')   # ir's work on string

        name        age  percantage
count      7   7.000000    7.000000
unique     7        NaN         NaN
top     anuj        NaN         NaN
freq       1        NaN         NaN
mean     NaN  30.857143   72.267143
std      NaN   5.550633    9.943133
min      NaN  25.000000   59.760000
25%      NaN  26.500000   63.890000
50%      NaN  30.000000   75.000000
75%      NaN  34.000000   79.165000
max      NaN  40.000000   85.000000

In [245]:
df['rank']=[4,5,2,1,3,6,7]

In [246]:
df

     name  age  percantage  rank
0    anuj   25       59.76     4
1    rimi   26       67.78     5
2    amit   30       80.00     2
3  shobha   32       85.00     1
4   arnav   27       78.33     3
5    abhi   36       60.00     6
6   tarun   40       75.00     7

In [247]:
d=pd.Series({'name':'raju','age':45,'percantage':78.50,'rank':8})

In [248]:
df

     name  age  percantage  rank
0    anuj   25       59.76     4
1    rimi   26       67.78     5
2    amit   30       80.00     2
3  shobha   32       85.00     1
4   arnav   27       78.33     3
5    abhi   36       60.00     6
6   tarun   40       75.00     7

In [249]:
df['rank']=[4,5,2,1,3,6,7]
df

     name  age  percantage  rank
0    anuj   25       59.76     4
1    rimi   26       67.78     5
2    amit   30       80.00     2
3  shobha   32       85.00     1
4   arnav   27       78.33     3
5    abhi   36       60.00     6
6   tarun   40       75.00     7

In [250]:
data ={'name':pd.Series(['anuj','rimi','amit','shobha','arnav','abhi','tarun']),'age':pd.Series([25,26,30,32,27,36,40]),'percantage':pd.Series([59.76,67.78,80,85,78.33,60,75])}
df=pd.DataFrame(data)
df

     name  age  percantage
0    anuj   25       59.76
1    rimi   26       67.78
2    amit   30       80.00
3  shobha   32       85.00
4   arnav   27       78.33
5    abhi   36       60.00
6   tarun   40       75.00

In [251]:
d

name          raju
age             45
percantage    78.5
rank             8
dtype: object

In [252]:
df['rank']=[4,5,2,1,3,6,7]
df

     name  age  percantage  rank
0    anuj   25       59.76     4
1    rimi   26       67.78     5
2    amit   30       80.00     2
3  shobha   32       85.00     1
4   arnav   27       78.33     3
5    abhi   36       60.00     6
6   tarun   40       75.00     7

In [253]:
df.append({'name':'raju','age':45,'percantage':78.50,'rank':8},ignore_index=True)     # its must use

     name  age  percantage  rank
0    anuj   25       59.76     4
1    rimi   26       67.78     5
2    amit   30       80.00     2
3  shobha   32       85.00     1
4   arnav   27       78.33     3
5    abhi   36       60.00     6
6   tarun   40       75.00     7
7    raju   45       78.50     8

In [254]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [255]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
name          7 non-null object
age           7 non-null int64
percantage    7 non-null float64
rank          7 non-null int64
dtypes: float64(1), int64(2), object(1)
memory usage: 304.0+ bytes

In [256]:
df.axes

[RangeIndex(start=0, stop=7, step=1),
 Index(['name', 'age', 'percantage', 'rank'], dtype='object')]

In [257]:
df=pd.DataFrame((np.array(range(1,16)).reshape(5,3)),columns=['a','b','c'])
df

    a   b   c
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15

In [258]:
for i in df:
    for e in i:
        print(e)

a
b
c

In [259]:
for key , value in df .iteritems():
    print(key,value)

a 0     1
1     4
2     7
3    10
4    13
Name: a, dtype: int32
b 0     2
1     5
2     8
3    11
4    14
Name: b, dtype: int32
c 0     3
1     6
2     9
3    12
4    15
Name: c, dtype: int32

In [260]:
# row index alongwith actual row

In [261]:
for row_index ,row in df. iterrows():
    print(row_index,row,end=('\n\n'))

0 a    1
b    2
c    3
Name: 0, dtype: int32

1 a    4
b    5
c    6
Name: 1, dtype: int32

2 a    7
b    8
c    9
Name: 2, dtype: int32

3 a    10
b    11
c    12
Name: 3, dtype: int32

4 a    13
b    14
c    15
Name: 4, dtype: int32

In [262]:
# itertuples()

In [263]:
for row in df.itertuples():
    print(row)

Pandas(Index=0, a=1, b=2, c=3)
Pandas(Index=1, a=4, b=5, c=6)
Pandas(Index=2, a=7, b=8, c=9)
Pandas(Index=3, a=10, b=11, c=12)
Pandas(Index=4, a=13, b=14, c=15)

# Sorting

In [264]:
i =[4,3,1,2,0]
df=df.reindex(i)            # save karne ke liye 2 bar df liya

In [265]:
df

    a   b   c
4  13  14  15
3  10  11  12
1   4   5   6
2   7   8   9
0   1   2   3

In [266]:
df.sort_index()

    a   b   c
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15

In [267]:
df.sort_index(ascending=False)

    a   b   c
4  13  14  15
3  10  11  12
2   7   8   9
1   4   5   6
0   1   2   3

In [268]:
# sort values

In [269]:
df.sort_values(by='c',ascending=False)

    a   b   c
4  13  14  15
3  10  11  12
2   7   8   9
1   4   5   6
0   1   2   3

In [270]:
# to identifies nan in all tabel

In [271]:
df.sort_values(by=['a','b','c'],na_position='first')

    a   b   c
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15

In [272]:
# it's work only string
s = pd.Series(['dhoni  ',' virat','rohit_','Hardik@',np.nan,'     1234','bumhrha          '])
s

0              dhoni
1                virat
2               rohit_
3              Hardik@
4                  NaN
5                 1234
6    bumhrha
dtype: object

In [273]:
n=s.str.strip()
n

0      dhoni
1      virat
2     rohit_
3    Hardik@
4        NaN
5       1234
6    bumhrha
dtype: object

In [274]:
df= pd.DataFrame(n)
df

         0
0    dhoni
1    virat
2   rohit_
3  Hardik@
4      NaN
5     1234
6  bumhrha

In [275]:
# str. strip not work on dataframe  its work on 1 d like series

In [276]:
n.str.upper()

0      DHONI
1      VIRAT
2     ROHIT_
3    HARDIK@
4        NaN
5       1234
6    BUMHRHA
dtype: object

In [277]:
n.str.title()

0      Dhoni
1      Virat
2     Rohit_
3    Hardik@
4        NaN
5       1234
6    Bumhrha
dtype: object

In [278]:
# all string function work

In [279]:
s.str.split(' ')

0                      [dhoni, , ]
1                        [, virat]
2                         [rohit_]
3                        [Hardik@]
4                              NaN
5                 [, , , , , 1234]
6    [bumhrha, , , , , , , , , , ]
dtype: object

In [280]:
s.str.replace('h','2')

0              d2oni
1                virat
2               ro2it_
3              Hardik@
4                  NaN
5                 1234
6    bum2r2a
dtype: object

In [281]:
s.str.repeat(3)

0                                dhoni  dhoni  dhoni
1                                    virat virat virat
2                                   rohit_rohit_rohit_
3                                Hardik@Hardik@Hardik@
4                                                  NaN
5                               1234     1234     1234
6    bumhrha          bumhrha          bumhrha     ...
dtype: object

In [282]:
s.str.count('a')

0    0.0
1    1.0
2    0.0
3    1.0
4    NaN
5    0.0
6    1.0
dtype: float64

In [283]:
s.str.startswith(' ')

0    False
1     True
2    False
3    False
4      NaN
5     True
6    False
dtype: object

# Apply Function In Pandas

In [284]:
import numpy as np
import pandas as pd

In [285]:
def adder(ele1,ele2):
    return ele1+ele2

In [286]:
df = pd.DataFrame(np.random.rand(5,3),columns=['col1','col2','col3'])
df

       col1      col2      col3
0  0.034583  0.348654  0.564299
1  0.527081  0.044075  0.737717
2  0.887769  0.627033  0.877412
3  0.706014  0.404811  0.645581
4  0.843946  0.313163  0.072262

In [287]:
df.pipe(adder,2)            # pipe is built in functions for pandas dataframe

       col1      col2      col3
0  2.034583  2.348654  2.564299
1  2.527081  2.044075  2.737717
2  2.887769  2.627033  2.877412
3  2.706014  2.404811  2.645581
4  2.843946  2.313163  2.072262

In [288]:
df.apply(np.mean)

col1    0.599879
col2    0.347547
col3    0.579454
dtype: float64

In [289]:
df['mean']=df.apply(np.mean)
df

       col1      col2      col3  mean
0  0.034583  0.348654  0.564299   NaN
1  0.527081  0.044075  0.737717   NaN
2  0.887769  0.627033  0.877412   NaN
3  0.706014  0.404811  0.645581   NaN
4  0.843946  0.313163  0.072262   NaN

In [290]:
df['mean']=df.apply(np.mean,axis=1)
df

       col1      col2      col3      mean
0  0.034583  0.348654  0.564299  0.315845
1  0.527081  0.044075  0.737717  0.436291
2  0.887769  0.627033  0.877412  0.797405
3  0.706014  0.404811  0.645581  0.585469
4  0.843946  0.313163  0.072262  0.409790

In [291]:
df['newline']=df.apply(lambda x:x.mean(),axis=1)
df

       col1      col2      col3      mean   newline
0  0.034583  0.348654  0.564299  0.315845  0.315845
1  0.527081  0.044075  0.737717  0.436291  0.436291
2  0.887769  0.627033  0.877412  0.797405  0.797405
3  0.706014  0.404811  0.645581  0.585469  0.585469
4  0.843946  0.313163  0.072262  0.409790  0.409790

In [292]:
# columnwise map function
df['col3'].map(lambda x: x*100)

0    56.429942
1    73.771662
2    87.741178
3    64.558112
4     7.226248
Name: col3, dtype: float64

In [293]:
def m (n):
    return n*100
df['col3'].map(m)

0    56.429942
1    73.771662
2    87.741178
3    64.558112
4     7.226248
Name: col3, dtype: float64

In [294]:
df

       col1      col2      col3      mean   newline
0  0.034583  0.348654  0.564299  0.315845  0.315845
1  0.527081  0.044075  0.737717  0.436291  0.436291
2  0.887769  0.627033  0.877412  0.797405  0.797405
3  0.706014  0.404811  0.645581  0.585469  0.585469
4  0.843946  0.313163  0.072262  0.409790  0.409790

# Reindexing

In [295]:
index=['chrome','safari','firefox','IE10','Konqure']
df=pd.DataFrame({'Http_status':[200,400,500,300,100],'responce_time':[0.04,0.02,0.07,0.08,1.01]},index=index)
df

         Http_status  responce_time
chrome           200           0.04
safari           400           0.02
firefox          500           0.07
IE10             300           0.08
Konqure          100           1.01

In [296]:
new_index=['safari','iceweaseal','comdodragon','IE10','Konqure']
df1=df.reindex(new_index)
df1                                   # it check existing index put new index as NaN only new index change existing as it is

             Http_status  responce_time
safari             400.0           0.02
iceweaseal           NaN            NaN
comdodragon          NaN            NaN
IE10               300.0           0.08
Konqure            100.0           1.01

# Least fill nan Values by zeros

In [297]:
df1

             Http_status  responce_time
safari             400.0           0.02
iceweaseal           NaN            NaN
comdodragon          NaN            NaN
IE10               300.0           0.08
Konqure            100.0           1.01

In [298]:
df.reindex(new_index,fill_value=0)

             Http_status  responce_time
safari               400           0.02
iceweaseal             0           0.00
comdodragon            0           0.00
IE10                 300           0.08
Konqure              100           1.01

In [299]:
df1.fillna(10)

             Http_status  responce_time
safari             400.0           0.02
iceweaseal          10.0          10.00
comdodragon         10.0          10.00
IE10               300.0           0.08
Konqure            100.0           1.01

# we can replace NaN by str

In [300]:
df.reindex(new_index,fill_value='tarun')

            Http_status responce_time
safari              400          0.02
iceweaseal        tarun         tarun
comdodragon       tarun         tarun
IE10                300          0.08
Konqure             100          1.01

# Reindexing of columns

In [301]:
df.reindex(columns=['Http_status','User_agent','responce_time'])

         Http_status  User_agent  responce_time
chrome           200         NaN           0.04
safari           400         NaN           0.02
firefox          500         NaN           0.07
IE10             300         NaN           0.08
Konqure          100         NaN           1.01

In [302]:
df1['Http_status'].fillna(4)

safari         400.0
iceweaseal       4.0
comdodragon      4.0
IE10           300.0
Konqure        100.0
Name: Http_status, dtype: float64

In [303]:
df1.reindex(new_index).ffill()        # fill the values with pervious valiues

             Http_status  responce_time
safari             400.0           0.02
iceweaseal         400.0           0.02
comdodragon        400.0           0.02
IE10               300.0           0.08
Konqure            100.0           1.01

In [304]:
df1.reindex(new_index).bfill()          # bacward fill

             Http_status  responce_time
safari             400.0           0.02
iceweaseal         300.0           0.08
comdodragon        300.0           0.08
IE10               300.0           0.08
Konqure            100.0           1.01

In [305]:
df.reindex(new_index).ffill()

             Http_status  responce_time
safari             400.0           0.02
iceweaseal         400.0           0.02
comdodragon        400.0           0.02
IE10               300.0           0.08
Konqure            100.0           1.01

In [306]:
#imp

data  = pd.read_excel('TARUN.xlsx' )

In [307]:
data.info()                   # - give the info about file

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
roll no    10 non-null int64
name       10 non-null object
marks      10 non-null int64
dtypes: int64(2), object(1)
memory usage: 320.0+ bytes

# finding null vlaues

In [308]:
data.isnull()

   roll no  name   marks
0    False  False  False
1    False  False  False
2    False  False  False
3    False  False  False
4    False  False  False
5    False  False  False
6    False  False  False
7    False  False  False
8    False  False  False
9    False  False  False

In [309]:
 data.isnull().sum()          #- it check how many empty fildes are avilable

roll no    0
name       0
marks      0
dtype: int64

#  fillna method

method=pad files NaN previous value for

In [310]:
data.fillna(method='pad',inplace =True) # pad means forward fill
data                                      # inplace means data persist

   roll no   name   marks
0        1   tarun     56
1        2    weji     85
2        3     sjh     78
3        4     sdh     74
4        5  sa;ldk     45
5        6    ljkh     75
6        7     sdh     55
7        8     asd     45
8        9     dff     65
9       10   sdifu     78

# method = backfill files with next value

In [311]:
data.fillna(method='backfill')

   roll no   name   marks
0        1   tarun     56
1        2    weji     85
2        3     sjh     78
3        4     sdh     74
4        5  sa;ldk     45
5        6    ljkh     75
6        7     sdh     55
7        8     asd     45
8        9     dff     65
9       10   sdifu     78